Revit 2027 API
PathOfTravel.PathEnd Property
 The end point of the path. The Z coordinate will equal the view's level elevation. To update path calculations, call update.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ PathEnd { get; set; }
Public Property PathEnd As XYZ
	Get
	Set
public:
property XYZ^ PathEnd {
	XYZ^ get ();
	void set (XYZ^ value);
}
member PathEnd : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: This functionality is not available in Revit LT. -or- When setting this property: Cannot perform this operation for a path of travel in a group.
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace